//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Εσφαλμένο όνομα χρήστη ή συνθηματικό";
"_cancelled_by_user"                    = "Η μεταφορά ακυρώθηκε";
"_error_folder_destiny_is_the_same_"    = "Δεν είναι δυνατή η μετακίνηση του φακέλου στον εαυτό του";
"_error_not_permission_"                = "Δεν έχετε δικαιώματα για να ολοκληρώσετε την λειτουργία";
"_error_path_"                          = "Αδυναμία ανοίγματος αρχείου ή φακέλου. Παρακαλούμε βεβαιωθείτε αν υπάρχει το αρχείο";
"_file_upload_not_exitst_"              = "The file that you want to upload does not exist";
"_forbidden_characters_from_server_"    = "Το όνομα περιέχει τουλάχιστο ένα μη έγκυρο χαρακτήρα";
"_not_connected_internet_"              = "Σφάλμα σύνδεσης διακομιστή";
"_not_possible_connect_to_server_"      = "Αδυναμία σύνδεσης με τον διακομιστή αυτή τη στιγμή";
"_not_possible_create_folder_"          = "Αδυναμία δημιουργίας φακέλου";
"_server_down_"                         = "Could not establish contact with server";
"_time_out_"                            = "Λήξη χρόνου, δοκιμάστε ξανά";
"_unknow_response_server_"              = "Μη αναμενόμενη απάντηση από τον διακομιστή";
"_user_autentication_required_"         = "Απαιτείται πιστοποίηση χρήστη";
"_file_directory_locked_"               = "Κλειδώθηκε το αρχείο ή ο κατάλογος";
"_ssl_certificate_untrusted_"           = "Το πιστοποιητικό για αυτόν τον διακομιστή δεν είναι έγκυρο";
"_internal_server_"                     = "Εσωτερικό σφάλμα διακομιστή";
"_file_already_exists_"                 = "Could not complete the operation, a file with the same name exists";
"_file_folder_not_exists_"              = "Το πηγαίο αρχείο δεν βρέθηκε στην καθορισμένη διαδρομή";
"_folder_contents_nochanged_"           = "Τα περιεχόμενα του φακέλου δεν άλλαξαν";
"_images_invalid_converted_"            = "Η εικόνα δεν είναι έγκυρη και δεν μπορεί να μετατραπεί σε μικρογραφία";
"_method_not_expected_"                 = "Unexpected request method";
"_reauthenticate_user_"                 = "Access expired, log in again";
"_server_error_retry_"                  = "Ο διακομιστής δεν είναι προσωρινά διαθέσιμος";
"_too_many_files_"                      = "Too many files would be involved in this operation";
"_too_many_request_"                    = "Sending too many requests caused the rate limit to be reached";
"_user_over_quota_"                     = "Επιτεύχθηκε το όριο αποθηκευτικου χώρου";
"_ssl_connection_error_"                = "Σφάλμα σύνδεσης SSL, δοκιμάστε ξανά";
"_bad_request_"                         = "Bad request";
"_webdav_locked_"                       = "WebDAV Locked: Trying to access locked resource";
"_error_user_not_available_"            = "Ο χρήστης δεν είναι πλέον διαθέσιμος";
"_server_response_error_"               = "Server response content error";


